vito-o/embedded-base/keil-workspace-stm32/11-1-软件SPI读写W25Q64/User/main.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "OLED.h"
#include "W25Q64.h"

uint8_t MID;
uint16_t DID;

uint8_t ArrayWrite[] = {0x02, 0xCC, 0x03, 0x22};
uint8_t ArrayRead[4];

int main()
{
	OLED_Init();
	W25Q64_init();
	
	OLED_ShowString(1, 1, "MID:   DID:");
	OLED_ShowString(2, 1, "W:");
	OLED_ShowString(3, 1, "R:");
	
	W25Q64_ReadID(&MID, &DID);
	OLED_ShowHexNum(1,  5, MID, 2);		// 显示MID
	OLED_ShowHexNum(1, 12, DID, 4);		// 显示DID
	
	// W25Q64功能函数测试
	W25Q64_SectorErase(0x000000);			// 扇区擦除
	
	// 写数据
	W25Q64_PageProgram(0x000000, ArrayWrite, 4);
	// 读数据
	W25Q64_ReadData(0x000000, ArrayRead, 4);
	
	// 显示数据
	OLED_ShowHexNum(2, 3, ArrayWrite[0], 2);
	OLED_ShowHexNum(2, 6, ArrayWrite[1], 2);
	OLED_ShowHexNum(2, 9, ArrayWrite[2], 2);
	OLED_ShowHexNum(2, 12, ArrayWrite[3], 2);
	
	OLED_ShowHexNum(3, 3, ArrayRead[0], 2);
	OLED_ShowHexNum(3, 6, ArrayRead[1], 2);
	OLED_ShowHexNum(3, 9, ArrayRead[2], 2);
	OLED_ShowHexNum(3, 12, ArrayRead[3], 2);
	
	while(1)
	{
		
	}
}
